In [29]:
import pandas as pd
from pandas import Series, DataFrame
data = {'Chinese': [66, 95, 93, 90,80],'English': [65, 85, 92, 88, 90],'Math': [30, 98, 96, 77, 90]}
df = DataFrame(data, index=['ZhangFei', 'GuanYu', 'ZhaoYun', 'HuangZhong', 'DianWei'])
df

            Chinese  English  Math
ZhangFei         66       65    30
GuanYu           95       85    98
ZhaoYun          93       92    96
HuangZhong       90       88    77
DianWei          80       90    90

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
sepal length (cm)    150 non-null float64
sepal width (cm)     150 non-null float64
petal length (cm)    150 non-null float64
petal width (cm)     150 non-null float64
dtypes: float64(4)
memory usage: 4.8 KB

### 查看数据

In [59]:
df.describe()
df.info()
df.isnull().sum()
df.isnull().any()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, ZhangFei to DianWei
Data columns (total 3 columns):
Chinese    5 non-null int64
English    5 non-null int64
Math       5 non-null int64
dtypes: int64(3)
memory usage: 160.0+ bytes

Chinese    False
English    False
Math       False
dtype: bool

In [ ]:
清洗数据

In [ ]:
# 处理缺失数据
df.dropna()
df['Age'].fillna(df['Age'].mean(),inplace=True)

max_v=df['Age'].value_counts().index[0]
df['Age'].fillna(max_v,inplace=True)

In [37]:
import pandas as pd
from pandas import DataFrame
from pandasql import sqldf, load_meat, load_births
df1 = DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5)})
pysqldf = lambda x: sqldf(x, globals())
sql = "select * from df1 where name ='ZhangFei'"
pysqldf(sql)

       name  data1
0  ZhangFei      0

### 合并df

In [54]:
df1 = DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5),'data3':['dddd','e','a','f','z']})
df2 = DataFrame({'name':['ZhangFei', 'GuanYu', 'A', 'B', 'C'], 'data1':range(5)})

In [61]:
pd.merge(df1,df2,how='inner')

       name  data1 data3
0  ZhangFei      0  dddd
1    GuanYu      1     e

### apply函数的使用

In [16]:
def plus(df,n,m):
    df['new1'] = (df[u'Chinese']+df[u'English']) * m
    df['new2'] = (df[u'Chinese']+df[u'English']) * n
    return df
df.apply(plus,axis=1,args=(2,3))# args=不可省略

            English  Math  Chinese  new1  new2
ZhangFei         65    30       66   393   262
GuanYu           85    98       95   540   360
ZhaoYun          92    96       93   555   370
HuangZhong       88    77       90   534   356
DianWei          90    90       80   510   340